src/DataProcessors/МодульОбменаЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>МодульОбменаЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМарокЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМарки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ФормированиеГрупповойТарыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ФормированиеГрупповойТарыЕГАИС</Name>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.АктСписанияЕГАИС</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМарокЕГАИС</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазовое</Name>
							<Comment>Количество номенклатуры в базовых единицах (коэффициент=1)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркировкаУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Упаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркировкаУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркировкаГруппыУпаковок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньВложенности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЛогЕдиницы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/МодульОбменаЕГАИС/Forms/ФормаПодборУпаковок/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьТипУпаковки(Данные)
	
	ТипУпаковки = Сред(Данные, 13, 1);
	
	Возврат ТипУпаковки;
	
КонецФункции

&НаСервере
Процедура ПоискМарокПоУпаковке(МаркировкаУпаковки, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МаркиТары.Ссылка.Дата КАК Дата,
	|	МаркиТары.Ссылка,
	|	МаркиТары.КодМарки КАК КодМарки,
	|	МаркиТары.МаркировкаУпаковки КАК МаркировкаУпаковки
	|ПОМЕСТИТЬ
	|	МаркиТары
	|ИЗ
	|	Документ.ФормированиеГрупповойТарыЕГАИС.Марки КАК МаркиТары
	|ГДЕ
	|	МаркиТары.МаркировкаУпаковки = &МаркировкаУпаковки
	|;
	|
	|ВЫБРАТЬ
	|	Марки.Ссылка.Дата КАК Дата,
	|	Марки.Ссылка КАК Ссылка,
	|	Марки.КодМарки КАК КодМарки,
	|	Марки.МаркировкаУпаковки КАК МаркировкаУпаковки,
	|	Товары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	Товары.Справка2 КАК Справка2
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Марки КАК Марки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК Товары
	|ПО
	|	Марки.ИдентификаторСтроки = Товары.ИдентификаторСтроки И 
	|	Марки.Ссылка = Товары.Ссылка
	|ГДЕ
	|	Марки.МаркировкаУпаковки = &МаркировкаУпаковки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Марки.Ссылка.Дата КАК Дата,
	|	Марки.Ссылка,
	|	Марки.КодМарки КАК КодМарки,
	|	Марки.МаркировкаУпаковки КАК МаркировкаУпаковки,
	|	Товары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	Товары.Справка2 КАК Справка2
	|ИЗ
	|	Документ.ОтчетОбИмпортеПродукцииЕГАИС.Марки КАК Марки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ОтчетОбИмпортеПродукцииЕГАИС.Товары КАК Товары
	|ПО
	|	Марки.ИдентификаторСтроки = Товары.ИдентификаторСтроки И 
	|	Марки.Ссылка = Товары.Ссылка
	|ГДЕ
	|	Марки.МаркировкаУпаковки = &МаркировкаУпаковки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаркиТары.Дата КАК Дата,
	|	МаркиТары.Ссылка,
	|	МаркиТары.КодМарки КАК КодМарки,
	|	МаркиТары.МаркировкаУпаковки КАК МаркировкаУпаковки,
	|	ОстаткиМарокЕГАИС.Справка2.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ОстаткиМарокЕГАИС.Справка2 КАК Справка2
	|ИЗ
	|	МаркиТары КАК МаркиТары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(, КодМарки В (ВЫБРАТЬ КодМарки ИЗ МаркиТары)) КАК ОстаткиМарокЕГАИС
	|ПО
	|	МаркиТары.КодМарки = ОстаткиМарокЕГАИС.КодМарки
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(АлкогольнаяПродукция)
	|ПО
	|	Ссылка
	|";
	
	
	Запрос.УстановитьПараметр("МаркировкаУпаковки", МаркировкаУпаковки);
	
	ВыборкаДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаДокументы.Следующий() Тогда
		Если НЕ ВыборкаДокументы.АлкогольнаяПродукция = АлкогольнаяПродукция Тогда
			ВывестиСообщение(НСтр("ru='Найденная по идентификатору упаковки алкогольная продукция <%1> не соответствует алкогольной продукции, указанной в строке <%2>'"),,,, Отказ, СокрЛП(ВыборкаДокументы.АлкогольнаяПродукция), СокрЛП(АлкогольнаяПродукция));
			Возврат;
		КонецЕсли;
		Выборка = ВыборкаДокументы.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.Справка2 = Справка2 Тогда
				ВывестиСообщение(НСтр("ru='Найденная по идентификатору упаковки справка 2 <%1> не соответствует справке 2, указанной в строке <%2>'"),,,, Отказ, СокрЛП(Выборка.Справка2), СокрЛП(Справка2));
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Марки.Добавить();
			НоваяСтрока.КодМарки           = Выборка.КодМарки;
			НоваяСтрока.МаркировкаУпаковки = МаркировкаУпаковки;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСледующийУровень(РодительГруппировки, МаркировкаУпаковки)
	
	СтруктураПоиска = Новый Структура("МаркировкаУпаковки", МаркировкаУпаковки);
	ТекущаяГруппировка = Неопределено;
	ЭлементыДерева = РодительГруппировки.ПолучитьЭлементы();
	Для Каждого ТекСтрока Из ЭлементыДерева Цикл
		Если ТекСтрока.МаркировкаУпаковки = МаркировкаУпаковки Тогда
			ТекущаяГруппировка = ТекСтрока;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекущаяГруппировка = Неопределено Тогда
		ТекущаяГруппировка = ЭлементыДерева.Добавить();
		ТекущаяГруппировка.МаркировкаУпаковки = МаркировкаУпаковки;
		//ТекущаяГруппировка.УровеньУпаковки = РодительГруппировки.УровеньУпаковки+1;
		ТекущаяГруппировка.ТипУпаковки     = ПолучитьТипУпаковки(МаркировкаУпаковки);
	КонецЕсли;
	
	Возврат ТекущаяГруппировка;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьДерево(СтрокаУпаковки)
	
	ЭлементыДерева = СтрокаУпаковки.ПолучитьЭлементы();
	Для Каждого ТекущаяСтрока Из ЭлементыДерева Цикл
		Элементы.ДеревоУпаковок.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = Истина;
	
	АлкогольнаяПродукция = ПолучитьЗначениеПараметраСтруктуры(Параметры, "АлкогольнаяПродукция");
	Справка2             = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Справка2");
	Количество           = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Количество");
	ИдентификаторСтроки  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ИдентификаторСтроки");
	
	Если Параметры.Свойство("Марки") Тогда
		Для Каждого ТекущаяСтрока Из Параметры.Марки Цикл
			НоваяСтрока = Марки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("Упаковки") Тогда
		Для Каждого ТекущаяСтрока Из Параметры.Упаковки Цикл
			НоваяСтрока = Упаковки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("УпаковкиДокумента") Тогда
		УпаковкиДокумента.ЗагрузитьЗначения(Параметры.УпаковкиДокумента);
	КонецЕсли;
	
	Заголовок = СокрЛП(АлкогольнаяПродукция) + ", кол.: " + Формат(Количество, "ЧН=0");
	
	ЭлементыДереваУпаковок = ДеревоУпаковок.ПолучитьЭлементы();
	ЭлементыДереваУпаковок.Очистить();
	
	ПервыйУровень = ЭлементыДереваУпаковок.Добавить();
	ПервыйУровень.МаркировкаУпаковки = "Структура упаковок";
	//ПервыйУровень.УровеньУпаковки    = 0;
	ПервыйУровень.ТипУпаковки        = "-";
	
	Если Упаковки.Количество() = 0 Тогда
		
		//ПервыйУровень = ЭлементыДереваУпаковок.Добавить();
		//ПервыйУровень.МаркировкаУпаковки = "Структура упаковок";
		
		ЭлементыПервогоУровня = ПервыйУровень.ПолучитьЭлементы();
		
		ТаблицаУпаковок = Марки.Выгрузить();
		ТаблицаУпаковок.Свернуть("МаркировкаУпаковки");
		Для Каждого СтрокаУпаковки Из ТаблицаУпаковок Цикл
			ТекущаяГруппировка = ЭлементыПервогоУровня.Добавить();
			ТекущаяГруппировка.МаркировкаУпаковки = СтрокаУпаковки.МаркировкаУпаковки;
			//ТекущаяГруппировка.УровеньУпаковки    = 1;
			ТекущаяГруппировка.ТипУпаковки        = ПолучитьТипУпаковки(СтрокаУпаковки.МаркировкаУпаковки);
		КонецЦикла;
		
	Иначе
		
		Упаковки.Сортировать("МаркировкаУпаковки, УровеньВложенности");
		
		МаркировкаУпаковки = "";
		УровеньВложенности = 1;
		ТекущаяГруппировка = Неопределено;
		
		Для Каждого СтрокаУпаковки Из Упаковки Цикл
			Если НЕ СтрокаУпаковки.МаркировкаУпаковки = МаркировкаУпаковки Тогда
				// Добавим последний уровень упаковок
				Если НЕ ТекущаяГруппировка = Неопределено Тогда
					//УровеньУпаковки = ТекущаяГруппировка.УровеньУпаковки+1;
					ТекущаяГруппировка = ТекущаяГруппировка.ПолучитьЭлементы().Добавить();
					ТекущаяГруппировка.МаркировкаУпаковки = МаркировкаУпаковки;
					//ТекущаяГруппировка.УровеньУпаковки    = УровеньУпаковки;
					ТекущаяГруппировка.ТипУпаковки        = ПолучитьТипУпаковки(МаркировкаУпаковки);
				КонецЕсли;
				// Добавим следующий уровень иерархии упаковок
				ТекущаяГруппировка = ПолучитьСледующийУровень(ПервыйУровень, СтрокаУпаковки.МаркировкаГруппыУпаковок);
				ТекущаяГруппировка.МаркировкаУпаковки = СтрокаУпаковки.МаркировкаГруппыУпаковок;
				ТекущаяГруппировка.ТипУпаковки        = ПолучитьТипУпаковки(СтрокаУпаковки.МаркировкаГруппыУпаковок);
				МаркировкаУпаковки = СтрокаУпаковки.МаркировкаУпаковки;
				Продолжить;
			КонецЕсли;
			ТекущаяГруппировка = ПолучитьСледующийУровень(ТекущаяГруппировка, СтрокаУпаковки.МаркировкаГруппыУпаковок);
		КонецЦикла;
		
		Если НЕ ТекущаяГруппировка = Неопределено Тогда
			//УровеньУпаковки = ТекущаяГруппировка.УровеньУпаковки+1;
			ТекущаяГруппировка = ТекущаяГруппировка.ПолучитьЭлементы().Добавить();
			ТекущаяГруппировка.МаркировкаУпаковки = МаркировкаУпаковки;
			//ТекущаяГруппировка.УровеньУпаковки    = УровеньУпаковки;
			ТекущаяГруппировка.ТипУпаковки        = ПолучитьТипУпаковки(МаркировкаУпаковки);
		КонецЕсли;
		
	КонецЕсли;
	
	
	//СтрокаДерева = ДеревоУпаковок.Строки[0];
	//Если СтрокаДерева.Строки.Количество()>0 Тогда
	//	ЭлементыФормы.ДеревоУпаковок.ТекущаяСтрока = СтрокаДерева.Строки[0];
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
	РазвернутьДерево(ДеревоУпаковок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуУпаковки(СтрокаВетки, ШтрихКод)
	
	Результат = Неопределено;
	
	КоллекцияПоиска = СтрокаВетки.ПолучитьЭлементы();
	
	Для Каждого ТекущаяСтрока Из КоллекцияПоиска Цикл
		
		Если ТекущаяСтрока.МаркировкаУпаковки = ШтрихКод Тогда
			Результат = ТекущаяСтрока.ПолучитьИдентификатор();
			//Элементы.МаркировкаУпаковок.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
		
		Результат = НайтиСтрокуУпаковки(ТекущаяСтрока, ШтрихКод);
		Если НЕ Результат = Неопределено Тогда
			Элементы.ДеревоУпаковок.Развернуть(Результат);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ШтрихКод = "";
	
	Если Источник="ПодключаемоеОборудование" Тогда
		
		Если НЕ ВводДоступен() Тогда
			Возврат;
		ИначеЕсли ИмяСобытия = "ScanData" Тогда
			ШтрихКод = ?((Параметр.Количество() > 1) И (Параметр[1] <> Неопределено), Параметр[1][1], Параметр[0]);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ШтрихКод) Тогда
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока = Неопределено;
	
	Данные = СокрЛП(ШтрихКод);
	
	Если СтрДлина(Данные)<>26 Тогда
		ВывестиСообщение(НСтр("ru='Некорректный код маркировки упаковки <%1>'"),,,,, Данные);
		Возврат;
	КонецЕсли;
	
	ТипУпаковки = Сред(Данные, 13, 1);
	
	СтрокаУпаковки = НайтиСтрокуУпаковки(ДеревоУпаковок, Данные);
	//СтрокаУпаковки = ДеревоУпаковок.ПолучитьЭлементы().Найти(Данные, "МаркировкаУпаковки", Истина);
	Если СтрокаУпаковки = Неопределено Тогда
		СтрокаУпаковки = УпаковкиДокумента.НайтиПоЗначению(Данные);
		Если НЕ СтрокаУпаковки=Неопределено Тогда
			ВывестиСообщение(НСтр("ru='Упаковка: <%1> уже внесена в документ'"),,,,, Данные);
			Возврат;
		КонецЕсли;
	Иначе
		Элементы.ДеревоУпаковок.ТекущаяСтрока = СтрокаУпаковки;
		ВывестиСообщение(НСтр("ru='Упаковка: <%1> уже внесена'"),,,,, Данные);
		Возврат;
	КонецЕсли;
	
	//Если БезИерархии Тогда
	//	СтрокаУпаковки = ДеревоУпаковок.Строки.Добавить();
	//	СтрокаУпаковки.МаркировкаУпаковки = Данные;
	//Иначе
	
	Если ТипУпаковки = "2" ИЛИ ТипУпаковки = "4" Тогда
		РодительУпаковки = ДеревоУпаковок.ПолучитьЭлементы()[0];
		СтрокаУпаковки = РодительУпаковки.ПолучитьЭлементы().Добавить();
		СтрокаУпаковки.МаркировкаУпаковки = Данные;
		//СтрокаУпаковки.УровеньУпаковки    = 1;
		СтрокаУпаковки.ТипУпаковки        = ПолучитьТипУпаковки(Данные);
		Элементы.ДеревоУпаковок.Развернуть(РодительУпаковки.ПолучитьИдентификатор());
		Элементы.ДеревоУпаковок.ТекущаяСтрока = СтрокаУпаковки.ПолучитьИдентификатор();
	Иначе
		
		Отказ = Ложь;
		ПоискМарокПоУпаковке(Данные, Отказ);
		Если Отказ Тогда
			НайденныеМарки = Марки.НайтиСтроки(Новый Структура("МаркировкаУпаковки", Данные));
			Для Каждого ТекущаяМарка Из НайденныеМарки Цикл
				Марки.Удалить(ТекущаяМарка);
			КонецЦикла;
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элементы.ДеревоУпаковок.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанные = ДеревоУпаковок.Строки[0];
		КонецЕсли;
		
		//Если ТекущиеДанные.УровеньУпаковки = 2 Тогда
		Если ТекущиеДанные.ТипУпаковки = "2" ИЛИ ТекущиеДанные.ТипУпаковки = "4" Тогда
			СтрокаУпаковки = ТекущиеДанные.ПолучитьЭлементы().Добавить();
		Иначе
			РодительУпаковки = ТекущиеДанные.ПолучитьРодителя();
			Если РодительУпаковки = Неопределено Тогда
				СтрокаУпаковки = ТекущиеДанные.ПолучитьЭлементы().Добавить();
			Иначе
				СтрокаУпаковки = РодительУпаковки.ПолучитьЭлементы().Добавить();
			КонецЕсли;
		КонецЕсли;
		
		РодительУпаковки = СтрокаУпаковки.ПолучитьРодителя().ПолучитьИдентификатор();
		
		//СтрокаУпаковки.УровеньУпаковки = 2;
		СтрокаУпаковки.ТипУпаковки        = ПолучитьТипУпаковки(Данные);
		СтрокаУпаковки.МаркировкаУпаковки = Данные;
		Элементы.ДеревоУпаковок.Развернуть(РодительУпаковки);
		Элементы.ДеревоУпаковок.ТекущаяСтрока = РодительУпаковки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУпаковокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУпаковокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУпаковки(Команда)
	
	Марки.Очистить();
	ЭлементыДереваУпаковок = ДеревоУпаковок.ПолучитьЭлементы();
	ЭлементыДереваУпаковок.Очистить();
	ПервыйУровень = ЭлементыДереваУпаковок.Добавить();
	ПервыйУровень.МаркировкаУпаковки = "Структура упаковок";
	ПервыйУровень.ТипУпаковки        = "-";
	//ПервыйУровень.УровеньУпаковки = 0;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьУпаковки(СтрокаДерева, Упаковки, УровеньВложенности = 1)
	
	Результат = Новый Массив;
	
	Для Каждого ТекущаяУпаковка Из СтрокаДерева.ПолучитьЭлементы() Цикл
		Если ТекущаяУпаковка.ПолучитьЭлементы().Количество() = 0 Тогда
			Результат.Добавить(ТекущаяУпаковка.МаркировкаУпаковки);
		Иначе
			ПолученныйРезультат = ПолучитьУпаковки(ТекущаяУпаковка, Упаковки, УровеньВложенности + 1);
			Для Каждого МаркировкаУпаковки Из ПолученныйРезультат Цикл
				НоваяСтрока = Новый Структура;
				НоваяСтрока.Вставить("МаркировкаУпаковки",       МаркировкаУпаковки);
				НоваяСтрока.Вставить("МаркировкаГруппыУпаковок", ТекущаяУпаковка.МаркировкаУпаковки);
				НоваяСтрока.Вставить("УровеньВложенности",       УровеньВложенности);
				
				Упаковки.Добавить(НоваяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	//Если Марки.Количество() > Количество Тогда 
	//	ПоказатьПредупреждение(,НСтр("ru='Количество введённых марок превышает количество марок в строке документа!'"));
	//	Возврат;
	//КонецЕсли;
	
	РезультатМарки    = Новый Массив;
	РезультатУпаковки = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Марки Цикл
		СтрокаМарки = Новый Структура;
		СтрокаМарки.Вставить("КодМарки",           ТекущаяСтрока.КодМарки);
		СтрокаМарки.Вставить("МаркировкаУпаковки", ТекущаяСтрока.МаркировкаУпаковки);
		РезультатМарки.Добавить(СтрокаМарки);
	КонецЦикла;
	
	//Упаковки.Колонки.Добавить("МаркировкаУпаковки");
	//Упаковки.Колонки.Добавить("МаркировкаГруппыУпаковок");
	//Упаковки.Колонки.Добавить("УровеньВложенности");
	
	СтрокаДерева = ДеревоУпаковок.ПолучитьЭлементы()[0];
	
	//СтрокаУпаковки = Новый Структура;
	//	СтрокаУпаковки.Вставить("КодМарки",           ТекущаяСтрока.КодМарки);
	//	СтрокаУпаковки.Вставить("МаркировкаУпаковки", ТекущаяСтрока.МаркировкаУпаковки);
	//	РезультатУпаковки.Добавить(СтрокаУпаковки);
	
	//ПолучитьУпаковки(ДеревоУпаковок, РезультатУпаковки);
	ПолучитьУпаковки(СтрокаДерева, РезультатУпаковки);
	
	Результат = Новый Структура;
	Результат.Вставить("Марки",    РезультатМарки);
	Результат.Вставить("Упаковки", РезультатУпаковки);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУпаковокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоУпаковок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ТаблицаМарок.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	Элементы.ТаблицаМарок.ОтборСтрок = Новый ФиксированнаяСтруктура("МаркировкаУпаковки", ТекущиеДанные.МаркировкаУпаковки);
	
КонецПроцедуры

&НаСервере
Процедура УдалениеМарок(ТекущаяГруппировка)
	
	НайденныеМарки = Марки.НайтиСтроки(Новый Структура("МаркировкаУпаковки", ТекущаяГруппировка.МаркировкаУпаковки));
	Для Каждого ТекущаяМарка Из НайденныеМарки Цикл
		Марки.Удалить(ТекущаяМарка);
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ТекущаяГруппировка.Строки Цикл
		УдалениеМарок(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУпаковокПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоУпаковок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Уровень() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УдалениеМарок(ТекущиеДанные);
	
КонецПроцедуры
